## Exercises - Basic SQL Queries

Here are some of the exercises for which you can write SQL queries to self evaluate.

In [13]:
%%HTML
<iframe width="560" height="315" src="https://www.youtube.com/embed/auRIHsKXV6o?rel=0&amp;controls=1&amp;showinfo=0" frameborder="0" allowfullscreen></iframe>

* Ensure that we have required database and user for retail data. **We might provide the database as part of our labs.** Here are the instructions to use `psql` for setting up the required database (if required) and tables.

```shell
psql -U postgres -h localhost -p 5432 -W
```

```sql
CREATE DATABASE itversity_retail_db;
CREATE USER itversity_retail_user WITH ENCRYPTED PASSWORD 'retail_password';
GRANT ALL ON DATABASE itversity_retail_db TO itversity_retail_user;
```

* Create Tables using the script provided. You can either use `psql` or **SQL Workbench**.

```shell
psql -U itversity_retail_user \
  -h localhost \
  -p 5432 \
  -d itversity_retail_db \
  -W
```

* You can drop the existing tables.

```sql
DROP TABLE order_items;
DROP TABLE orders;
DROP TABLE customers;
DROP TABLE products;
DROP TABLE categories;
DROP TABLE departments;
```

* Once the tables are dropped you can run below script to create the tables for the purpose of exercises.

```sql
\i /data/retail_db/create_db_tables_pg.sql
```

* Data shall be loaded using the script provided.

```sql
\i /data/retail_db/load_db_tables_pg.sql
```

* Run queries to validate we have data in all the 3 tables.

In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL=postgresql://itv001477_retail_user:xndxklzpkk2h37en8z32vzeekbuvwkca@m01.itversity.com:5433/itv001477_retail_db

env: DATABASE_URL=postgresql://itv001477_retail_user:xndxklzpkk2h37en8z32vzeekbuvwkca@m01.itversity.com:5433/itv001477_retail_db

In [ ]:
%sql select * from information_schema.tables;

### Exercise 1 - Customer order count

Get order count per customer for the month of 2014 January.
* Tables - orders and customers
* Data should be sorted in descending order by count and ascending order by customer id.
* Output should contain customer_id, customer_first_name, customer_last_name and customer_order_count.

In [22]:
%%sql
select o.order_customer_id,c.customer_fname,c.customer_lname,count(o.order_id) as customer_order_count  
from orders o join customers c on c.customer_id=o.order_customer_id
where to_char(o.order_date,'YYYY-MM') ~ '2014-01'
group by o.order_customer_id,c.customer_fname,c.customer_lname
order by o.order_customer_id,customer_order_count desc
limit 10;

 * postgresql://itv001477_retail_user:***@m01.itversity.com:5433/itv001477_retail_db
10 rows affected.

[(7, 'Melissa', 'Wilcox', 4),
 (8, 'Megan', 'Smith', 2),
 (13, 'Mary', 'Baldwin', 1),
 (14, 'Katherine', 'Smith', 1),
 (15, 'Jane', 'Luna', 1),
 (17, 'Mary', 'Robinson', 1),
 (18, 'Robert', 'Smith', 2),
 (24, 'Mary', 'Smith', 2),
 (26, 'Johnny', 'Hood', 2),
 (27, 'Mary', 'Vincent', 1)]

In [35]:
%%sql
select count(*) from (select o.order_customer_id,c.customer_fname,c.customer_lname,count(o.order_id) from orders o 
                      join customers c on c.customer_id=o.order_customer_id 
                     where to_char(o.order_date,'YYYY-MM') ~ '2014-01' 
                     group by o.order_customer_id,c.customer_fname,c.customer_lname) q;

 * postgresql://itv001477_retail_user:***@m01.itversity.com:5433/itv001477_retail_db
1 rows affected.

[(4696,)]

### Exercise 2 - Dormant Customers

Get the customer details who have not placed any order for the month of 2014 January.
* Tables - orders and customers
* Data should be sorted in ascending order by customer_id
* Output should contain all the fields from customers

In [4]:
%%sql
select c.customer_id,c.customer_fname,c.customer_lname,c.customer_email,c.customer_password,
c.customer_street,c.customer_state,c.customer_zipcode
from customers c
left outer join orders o on c.customer_id=o.order_customer_id
WHERE o.order_customer_id IS NULL AND to_char(o.order_date,'yyyy-MM') = '2014-01'
order by c.customer_id 
limit 10;

 * postgresql://itv001477_retail_user:***@m01.itversity.com:5433/itv001477_retail_db
0 rows affected.

[]

In [22]:
%%sql
select count(1) from (select c.customer_id,c.customer_fname,c.customer_lname,c.customer_email,c.customer_password,
c.customer_street,c.customer_state,c.customer_zipcode
from customers c
left outer join orders o on c.customer_id=o.order_customer_id
where o.order_customer_id IS NULL
order by c.customer_id ) q

 * postgresql://itv001477_retail_user:***@m01.itversity.com:5433/itv001477_retail_db
1 rows affected.

[(30,)]

### Exercise 3 - Revenue Per Customer

Get the revenue generated by each customer for the month of 2014 January
* Tables - orders, order_items and customers
* Data should be sorted in descending order by revenue and then ascending order by customer_id
* Output should contain customer_id, customer_first_name, customer_last_name, customer_revenue.
* If there are no orders placed by customer, then the corresponding revenue for a give customer should be 0.
* Consider only COMPLETE and CLOSED orders

In [5]:
%%sql 
select c.customer_id,c.customer_fname,c.customer_lname,coalesce(round(sum(oi.order_item_subtotal::numeric),2),0) as customer_revenue 
from customers c
LEFT OUTER join orders o on o.order_customer_id=c.customer_id
join order_items oi on oi.order_item_order_id=o.order_id
where to_char(o.order_date,'YYYY-MM') ~ '2014-01' and o.order_status in ('COMPLETE','CLOSED')
group by c.customer_id,c.customer_fname,c.customer_lname
order by c.customer_id,customer_revenue desc
limit 10;

 * postgresql://itv001477_retail_user:***@m01.itversity.com:5433/itv001477_retail_db
10 rows affected.

[(8, 'Megan', 'Smith', Decimal('353.93')),
 (14, 'Katherine', 'Smith', Decimal('704.93')),
 (17, 'Mary', 'Robinson', Decimal('569.95')),
 (18, 'Robert', 'Smith', Decimal('1309.85')),
 (26, 'Johnny', 'Hood', Decimal('699.96')),
 (28, 'Timothy', 'Smith', Decimal('59.99')),
 (38, 'Mary', 'Smith', Decimal('1209.83')),
 (42, 'Ethan', 'Smith', Decimal('559.94')),
 (43, 'Mary', 'Herring', Decimal('119.98')),
 (51, 'Jessica', 'Smith', Decimal('59.99'))]

In [23]:
%%sql
select count(1) from (select c.customer_id,c.customer_fname,c.customer_lname,round(sum(oi.order_item_subtotal::numeric),2) as customer_revenue 
from customers c
orders o on o.order_customer_id=c.customer_id
join order_items oi on oi.order_item_order_id=o.order_id
where to_char(o.order_date,'YYYY-MM') ~ '2014-01' and o.order_status in ('COMPLETE','CLOSED')
group by c.customer_id,c.customer_fname,c.customer_lname
order by c.customer_id,customer_revenue desc) q;

 * postgresql://itv001477_retail_user:***@m01.itversity.com:5433/itv001477_retail_db
1 rows affected.

[(1941,)]

### Exercise 4 - Revenue Per Category

Get the revenue generated for each category for the month of 2014 January
* Tables - orders, order_items, products and categories
* Data should be sorted in ascending order by category_id.
* Output should contain all the fields from category along with the revenue as category_revenue.
* Consider only COMPLETE and CLOSED orders

In [27]:
%%sql
select c.category_id,c.category_department_id,c.category_name,round(sum(oi.order_item_subtotal::numeric),2) as category_revenue
from categories c
join products p on p.product_category_id=c.category_id
join order_items oi on oi.order_item_product_id=p.product_id
join orders o on o.order_id=oi.order_item_order_id
where to_char(o.order_date,'YYYY-MM') ~ '2014-01' and o.order_status IN ('COMPLETE','CLOSED')
group by c.category_id,c.category_department_id,c.category_name
order by c.category_id;

 * postgresql://itv001477_retail_user:***@m01.itversity.com:5433/itv001477_retail_db
33 rows affected.

[(2, 2, 'Soccer', Decimal('1094.88')),
 (3, 2, 'Baseball & Softball', Decimal('3214.41')),
 (4, 2, 'Basketball', Decimal('1299.98')),
 (5, 2, 'Lacrosse', Decimal('1299.69')),
 (6, 2, 'Tennis & Racquet', Decimal('1124.75')),
 (7, 2, 'Hockey', Decimal('1433.00')),
 (9, 3, 'Cardio Equipment', Decimal('133156.77')),
 (10, 3, 'Strength Training', Decimal('3388.96')),
 (11, 3, 'Fitness Accessories', Decimal('1509.73')),
 (12, 3, 'Boxing & MMA', Decimal('3998.46')),
 (13, 3, 'Electronics', Decimal('4074.83')),
 (16, 3, 'As Seen on  TV!', Decimal('399.96')),
 (17, 4, 'Cleats', Decimal('152374.72')),
 (18, 4, "Men's Footwear", Decimal('107631.72')),
 (24, 5, "Women's Apparel", Decimal('114800.00')),
 (26, 5, "Girls' Apparel", Decimal('6564.85')),
 (29, 5, 'Shop By Sport', Decimal('40090.24')),
 (30, 6, "Men's Golf Clubs", Decimal('1974.83')),
 (31, 6, "Women's Golf Clubs", Decimal('279.97')),
 (32, 6, 'Golf Apparel', Decimal('1299.67')),
 (33, 6, 'Golf Shoes', Decimal('4869.00')),
 (34, 6, 'Golf Bags & Carts', Decimal('509.97')),
 (35, 6, 'Golf Gloves', Decimal('3994.07')),
 (36, 6, 'Golf Balls', Decimal('2754.44')),
 (37, 6, 'Electronics', Decimal('9261.72')),
 (38, 6, "Kids' Golf Clubs", Decimal('6416.55')),
 (40, 6, 'Accessories', Decimal('4423.23')),
 (41, 6, 'Trade-In', Decimal('2364.96')),
 (43, 7, 'Camping & Hiking', Decimal('148190.12')),
 (44, 7, 'Hunting & Shooting', Decimal('1784.61')),
 (45, 7, 'Fishing', Decimal('250787.46')),
 (46, 7, 'Indoor/Outdoor Games', Decimal('100309.86')),
 (48, 7, 'Water Sports', Decimal('113544.33'))]

In [26]:
%%sql
select count(1) from(select c.category_id,c.category_department_id,c.category_name,round(sum(oi.order_item_subtotal::numeric),2) as category_revenue
from categories c
join products p on p.product_category_id=c.category_id
join order_items oi on oi.order_item_product_id=p.product_id
join orders o on o.order_id=oi.order_item_order_id
where to_char(o.order_date,'YYYY-MM') ~ '2014-01' and o.order_status IN ('COMPLETE','CLOSED')
group by c.category_id,c.category_department_id,c.category_name
order by c.category_id) q

 * postgresql://itv001477_retail_user:***@m01.itversity.com:5433/itv001477_retail_db
1 rows affected.

[(33,)]

### Exercise 5 - Product Count Per Department

Get the products for each department.
* Tables - departments, categories, products
* Data should be sorted in ascending order by department_id
* Output should contain all the fields from department and the product count as product_count

In [28]:
%%sql
select d.department_id,d.department_name,count(p.product_id) as product_count from departments d
join categories c on c.category_department_id=d.department_id
join products p on p.product_category_id=c.category_id
group by  d.department_id,d.department_name
order by d.department_id
limit 10;

 * postgresql://itv001477_retail_user:***@m01.itversity.com:5433/itv001477_retail_db
6 rows affected.

[(2, 'Fitness', 168),
 (3, 'Footwear', 168),
 (4, 'Apparel', 140),
 (5, 'Golf', 120),
 (6, 'Outdoors', 336),
 (7, 'Fan Shop', 149)]